AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныАвтомобилей</Name>
			<Comment>Цены автомобилей</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль или модель для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Comment>Вариант комплектации для которго сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидАвтомобиля</Name>
			<Comment>Вид автомобиля</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
					<Comment>Новый автомобиль</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Агентский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Выкуп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_ГосУтилизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Демонстрационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_ДемоПродажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Зачет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Комиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Конверсия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Консигнация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Корпоративный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_НаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_НеОпределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_Подменный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DMS_VND</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтомобильСПробегом</Name>
					<Comment>Автомобиль с пробегом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпортБУ</Name>
					<Comment>Параллельный импорт БУ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодменныйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаритетныйАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническийАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
					<Comment>Параллельный импорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративнаяКвота</Name>
					<Comment>Корпоративная квота</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйПарк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыТоплива</Name>
			<Comment>Типы топлива</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Petrol</Name>
					<Comment>Бензин</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Diesel</Name>
					<Comment>Дизельное топливо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PressureGas</Name>
					<Comment>Сжатый газ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LiquefiedGas</Name>
					<Comment>Сжиженый газ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>None</Name>
					<Comment>Электро</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Gibrid</Name>
					<Comment>Гибрид</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Привод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Привод</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Передний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заднеприводный_с_подключаемым_передним</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полный_подключаемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный_привод_на_все_колеса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СМ_ВыгрузкаОбъявленийОПродажеАвто/Ext/Module.bsl
//Для auto.ru Cargo (Грузовой)
Функция ВернутьXMLкакСтрокуCargo(СЗ_КодовПодразделений) Экспорт
	
	СЗ_КодовРодителей = Новый СписокЗначений;
	
	МассивКодовРодителейПодразделений = обМояРазложитьСтрокуВМассивПодстрок(СЗ_КодовПодразделений, ";");
	СЗ_КодовРодителей.ЗагрузитьЗначения(МассивКодовРодителейПодразделений);
 	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Родитель.Код
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель.Код В (&СЗ_КодовРодителей)";
	
	Запрос.УстановитьПараметр("СЗ_КодовРодителей", СЗ_КодовРодителей);
	
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
   	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
		|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
		|	ЦенаАвто.Цена КАК Цена,
		|	ХарАвто.Значение КАК ВидАвто,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРуКоммерция.МаркаАвтоРуКоммерция КАК МаркаАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРуКоммерция КАК МодельАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
		|	ПробегиАвто.Значение КАК Пробег,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
		|	ГОД(ОстаткиАвтомобилейОстатки.Партия.Дата) КАК ГодДокаПоступленияАвто,
		|	ОстаткиАвтомобилейОстатки.Партия.Номер КАК НомерДокаПоступленияАвто
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
		|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
		|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
		|		ИЗ
		|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
		|		ГДЕ
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
		|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
		|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
		|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
		|	И ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС <> ЗНАЧЕНИЕ(Справочник.КатегорииТранспортныхСредств.АвтомобилиЛегковые)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
		|	ЦенаАвто.Цена,
		|	ХарАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
		|	ПробегиАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРуКоммерция,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРуКоммерция.МаркаАвтоРуКоммерция,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.КатегорияТС,
		|	ГОД(ОстаткиАвтомобилейОстатки.Партия.Дата),
		|	ОстаткиАвтомобилейОстатки.Партия.Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
     	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ИмяБазы = "alfaauto";
	Попытка
		Результат = Renault_внОбщийМодуль.ПараметрУникальностиИБ();
 		ИмяБазы = СокрЛП(Результат.ИмяБазы);
	Исключение
		//	
	КонецПопытки; 
	
 	СписокМарок = Новый СписокЗначений;
	
  	XML=Новый ЗаписьXML();
 	
	XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML.ЗаписатьОбъявлениеXML();
	
  	XML.ЗаписатьНачалоЭлемента("Data");
	
	XML.ЗаписатьНачалоЭлемента("Cars");
	
	Для каждого Стр1 Из ТЗ Цикл
		
 		//Если обЗначениеНеЗаполнено(Стр1.Цена) Тогда	Продолжить;	КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу) Тогда Продолжить; КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.МодельАвтоРу) Тогда Продолжить; КонецЕсли; 
 		//Если НЕ обЗначениеНеЗаполнено(Стр1.Подразделение) Тогда
		// 	СписокМарок = ПолучитьСписокМарокАвто(Стр1.Подразделение);
		//	Если СписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
		// 		Продолжить;	
		//	КонецЕсли; 
		//КонецЕсли; 
	 	
	 	XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРуКоммерция.Наименование);                     XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("group_id");            XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРуКоммерция.Наименование);                          XML.ЗаписатьКонецЭлемента();
		
		Если Стр1.ОкраскаМеталлик Тогда
			XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу)+" металлик");                                            XML.ЗаписатьКонецЭлемента();
		Иначе
			XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                        XML.ЗаписатьКонецЭлемента();
 		КонецЕсли; 
		 
 	    XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                                        XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                                       XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст("Отличное");                                                                         XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("haggle");              XML.ЗаписатьТекст("не возможен");                                                                      XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("exchange");            XML.ЗаписатьТекст("нет");                                                                              XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		
		Попытка
			ЦенаМинимальная =  СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,""))-Число(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));         
		Исключение
			Попытка
				ЦенаМинимальная = СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));
			Исключение
				ЦенаМинимальная = "";
			КонецПопытки; 		
		КонецПопытки; 
		
		XML.ЗаписатьНачалоЭлемента("price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(ЦенаМинимальная,Символы.НПП,"")));                                XML.ЗаписатьКонецЭлемента(); 

		XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                              XML.ЗаписатьКонецЭлемента();
  		XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                                XML.ЗаписатьКонецЭлемента();
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
	    Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	    	ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
	    	Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	    		ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
	  	    КонецЕсли; 
	    КонецЕсли; 
		
	 	XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                                         XML.ЗаписатьКонецЭлемента();	 

		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
			XML.ЗаписатьНачалоЭлемента("images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				XML.ЗаписатьНачалоЭлемента("image");
				Если ИмяБазы = "alfaauto" Тогда                                                                          
					//Бондаренко++ 20220303
					//XML.ЗаписатьТекст("https://it.sokolmotors.ru/alfaauto/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
					XML.ЗаписатьТекст("https://it.sokolmotors.ru/alfaauto/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.GUID+".jpg");
					//Бондаренко-- 20220303
				Иначе             
					//Бондаренко++ 20220303					
					//XML.ЗаписатьТекст("https://sm-1cdev01/"+ИмяБазы+"/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
					XML.ЗаписатьТекст("https://sm-1cdev01/"+ИмяБазы+"/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.GUID+".jpg");
					//Бондаренко-- 20220303
				КонецЕсли; 
				XML.ЗаписатьКонецЭлемента(); //url	
			КонецЦикла; 
			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли;
		
		//Уникальный идентификатор объявления. Элемент используется, если не указан VIN номер.Произвольный набор цифр, букв, знаков «-» и «_» до 50 символов.
		unique_id_str = ""+Стр1.Автомобиль.VIN+"_"+СтрЗаменить(Стр1.ГодДокаПоступленияАвто,Символы.НПП,"")+"_"+ Стр1.НомерДокаПоступленияАвто;
		
		XML.ЗаписатьНачалоЭлемента("unique_id");             XML.ЗаписатьТекст(unique_id_str);                                                 XML.ЗаписатьКонецЭлемента();	
		
		wheel_str = СокрЛП(Стр1.Автомобиль.Руль);
 		Если НЕ обЗначениеНеЗаполнено(wheel_str) Тогда
			XML.ЗаписатьНачалоЭлемента("wheel");             XML.ЗаписатьТекст(wheel_str);                                                     XML.ЗаписатьКонецЭлемента();
 		КонецЕсли;
		
		bus_type_str =  СокрЛП(Стр1.Автомобиль.ТипАвтобусаАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(bus_type_str) Тогда
			XML.ЗаписатьНачалоЭлемента("bus_type");          XML.ЗаписатьТекст(bus_type_str);                                                  XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		wheel_drive_str =  СокрЛП(Стр1.Автомобиль.КолеснаяФормулаАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(wheel_drive_str) Тогда
			XML.ЗаписатьНачалоЭлемента("wheel_drive");       XML.ЗаписатьТекст(wheel_drive_str);                                               XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		seats_str =  СокрЛП(Стр1.Автомобиль.КоличествоМест);
		Если НЕ обЗначениеНеЗаполнено(seats_str) Тогда
			XML.ЗаписатьНачалоЭлемента("seats");             XML.ЗаписатьТекст(seats_str);                                                     XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		engine_power_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.МощностьДвигателя),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(engine_power_str) Тогда
			XML.ЗаписатьНачалоЭлемента("engine_power");      XML.ЗаписатьТекст(engine_power_str);                                              XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		engine_volume_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.ОбъемДвигателя*1000),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(engine_volume_str) Тогда
			XML.ЗаписатьНачалоЭлемента("engine_volume");     XML.ЗаписатьТекст(engine_volume_str);                                             XML.ЗаписатьКонецЭлемента();
		КонецЕсли;

		engine_type_str =  СокрЛП(Стр1.Автомобиль.ТипДвигателяСайт);
		Если НЕ обЗначениеНеЗаполнено(engine_type_str) Тогда
			XML.ЗаписатьНачалоЭлемента("engine_type");       XML.ЗаписатьТекст(engine_type_str);                                               XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		gearbox_str =  СокрЛП(Стр1.Автомобиль.ТипКПП.ТипКПП_АутоРу);
		Если НЕ обЗначениеНеЗаполнено(gearbox_str) Тогда
			XML.ЗаписатьНачалоЭлемента("gearbox");            XML.ЗаписатьТекст(gearbox_str);                                                  XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		extras_flag = Стр1.Автомобиль.ИспользоватьОпцииМодели;
		Если extras_flag  Тогда
			Табл = Стр1.Автомобиль.Модель.ОпцииКоммерцияАвтоРу;
 		Иначе
			Табл = Стр1.Автомобиль.ОпцииКоммерцияАвтоРу;
		КонецЕсли;
		Всего_ОпцийАвтоРу = Табл.Количество();
 		Если Всего_ОпцийАвтоРу > 0 Тогда
			extras_str = "";
			Для каждого Стр Из Табл Цикл
				Если НЕ обЗначениеНеЗаполнено(extras_str) Тогда
					extras_str = СокрЛП(extras_str)+";"+СокрЛП(Стр.Опция);
 				Иначе
					extras_str = СокрЛП(Стр.Опция);
 				КонецЕсли; 
			КонецЦикла; 
			XML.ЗаписатьНачалоЭлемента("extras");          XML.ЗаписатьТекст(extras_str);                                                      XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
  		body_type_str =  СокрЛП(Стр1.Автомобиль.ТипКузоваКоммерцияАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(body_type_str) Тогда
			XML.ЗаписатьНачалоЭлемента("body_type");          XML.ЗаписатьТекст(body_type_str);                                                XML.ЗаписатьКонецЭлемента();
 		КонецЕсли;

		cabin_type_str =  СокрЛП(Стр1.Автомобиль.ТипКабиныКоммерцияАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(cabin_type_str) Тогда
			XML.ЗаписатьНачалоЭлемента("cabin_type");         XML.ЗаписатьТекст(cabin_type_str);                                               XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		loading_number =  Стр1.Автомобиль.Грузоподъемность;
		Если loading_number > 0 Тогда
			loading_str =  СтрЗаменить(СокрЛП(loading_number),Символы.НПП,"");
			Если НЕ обЗначениеНеЗаполнено(loading_str) Тогда
				XML.ЗаписатьНачалоЭлемента("loading");        XML.ЗаписатьТекст(loading_str);                                                  XML.ЗаписатьКонецЭлемента();
 			КонецЕсли;
		КонецЕсли;
		
		suspension_chassis_str =  СокрЛП(Стр1.Автомобиль.ПодвескаШассиКоммерцияАвтоРу);
		Если НЕ обЗначениеНеЗаполнено(suspension_chassis_str) Тогда
			XML.ЗаписатьНачалоЭлемента("suspension_chassis"); XML.ЗаписатьТекст(suspension_chassis_str);                                       XML.ЗаписатьКонецЭлемента();
		КонецЕсли;

		drive_str =  СокрЛП(Стр1.Автомобиль.Привод);
		Если НЕ обЗначениеНеЗаполнено(drive_str) Тогда
			XML.ЗаписатьНачалоЭлемента("drive");              XML.ЗаписатьТекст(drive_str);                                                    XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
  		XML.ЗаписатьКонецЭлемента(); //Car

	 КонецЦикла; 
	
	XML.ЗаписатьКонецЭлемента();	 //Cars
	
	XML.ЗаписатьКонецЭлемента();         //Data
	
	XMLТекст = XML.Закрыть();
	
 	Возврат XMLТекст;

КонецФункции // ВернутьXMLкакСтроку3()

//Для avito.ru
Функция ВернутьXMLкакСтроку4(СЗ_КодовПодразделений) Экспорт
	
	СЗ_КодовРодителей = Новый СписокЗначений;
	
	МассивКодовРодителейПодразделений = обМояРазложитьСтрокуВМассивПодстрок(СЗ_КодовПодразделений, ";");
	СЗ_КодовРодителей.ЗагрузитьЗначения(МассивКодовРодителейПодразделений);
 	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Родитель.Код
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель.Код В (&СЗ_КодовРодителей)";
	
	Запрос.УстановитьПараметр("СЗ_КодовРодителей", СЗ_КодовРодителей);
	
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
   	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
		
 	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
		|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
		|	ЦенаАвто.Цена КАК Цена,
		|	ХарАвто.Значение КАК ВидАвто,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
		|	ПробегиАвто.Значение КАК Пробег,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
		|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
		|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
		|		ИЗ
		|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
		|		ГДЕ
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
		|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
		|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
		|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
		|	ЦенаАвто.Цена,
		|	ХарАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
		|	ПробегиАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу
		|
		|УПОРЯДОЧИТЬ ПО
		|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
     	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ИмяБазы = "alfaauto";
	Попытка
		Результат = Renault_внОбщийМодуль.ПараметрУникальностиИБ();
 		ИмяБазы = СокрЛП(Результат.ИмяБазы);
	Исключение
		//	
	КонецПопытки; 
	
 	СписокМарок = Новый СписокЗначений;
  	
  	XML=Новый ЗаписьXML();
 	
	XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML.ЗаписатьОбъявлениеXML();
	
	XML.ЗаписатьНачалоЭлемента("Ads");
	XML.ЗаписатьАтрибут("formatVersion","3");
	XML.ЗаписатьАтрибут("target","Avito.ru");
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20200615	
		//Если обЗначениеНеЗаполнено(Стр1.Цена) Тогда	Продолжить;	КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.Марка.МаркаАвито) Тогда Продолжить; КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.МодельАвито) Тогда Продолжить; КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвито.Артикул) Тогда Продолжить; КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвито.Артикул) Тогда Продолжить; КонецЕсли; 
		//Бондаренко-- 20200615	
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Подразделение) Тогда
			СписокМарок = ПолучитьСписокМарокАвто(Стр1.Подразделение);
			Если СписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
				Продолжить;	
			КонецЕсли; 
		КонецЕсли; 
		
		//Бондаренко++ 20200707
		Если Стр1.Автомобиль.ПутьКФото.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли; 
		//Бондаренко++ 20200707	
		
 		XML.ЗаписатьНачалоЭлемента("Ad");
		
		XML.ЗаписатьНачалоЭлемента("Id");                  XML.ЗаписатьТекст(Стр1.Автомобиль.VIN); XML.ЗаписатьКонецЭлемента();
		
		ТекущееПодразделение = Стр1.Подразделение;
 		ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		Если обЗначениеНеЗаполнено(ПодразделениеАдрес) Тогда
 			ПодразделениеАдрес = киПолучитьПредставлениеКИ(ТекущееПодразделение, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		КонецЕсли;
  		
		XML.ЗаписатьНачалоЭлемента("Address");             XML.ЗаписатьТекст(ПодразделениеАдрес);                                                                XML.ЗаписатьКонецЭлемента();
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
	    Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	    	ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
	    	Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	    		Попытка ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	    			Попытка ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.Родитель.ТекстКлассифайда); Исключение	КонецПопытки;  
				КонецЕсли; 		
	  	    КонецЕсли; 
	    КонецЕсли; 
		
 		XML.ЗаписатьНачалоЭлемента("Description");         XML.ЗаписатьТекст(ТекстКлассифайда);                                                                  XML.ЗаписатьКонецЭлемента();	 //Description

		XML.ЗаписатьНачалоЭлемента("Category");            XML.ЗаписатьТекст("Автомобили");                                                                      XML.ЗаписатьКонецЭлемента();	 //Category
		XML.ЗаписатьНачалоЭлемента("CarType");             XML.ЗаписатьТекст("Новые");                                                                           XML.ЗаписатьКонецЭлемента();	 //CarType
		 
		//Если НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу) Тогда
		//XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу)); XML.ЗаписатьКонецЭлемента();
		//ИначеЕсли НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу) Тогда
		//XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу));              XML.ЗаписатьКонецЭлемента();
		//КонецЕсли; 
 		//XML.ЗаписатьНачалоЭлемента("wheel");               XML.ЗаписатьТекст(СокрЛП(Стр1.Руль));                                                                  XML.ЗаписатьКонецЭлемента();
		 
		//XML.ЗаписатьНачалоЭлемента("metallic");            XML.ЗаписатьТекст(СокрЛП(Нрег(Стр1.Автомобиль.Цвет.ОкраскаМеталлик)));                                 XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                                        XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                                       XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст(СокрЛП(Стр1.Состояние));                                                             XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("owners_number");       XML.ЗаписатьТекст("Не было владельцев");                                                               XML.ЗаписатьКонецЭлемента();
 		//XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                                XML.ЗаписатьКонецЭлемента();
 		//XML.ЗаписатьНачалоЭлемента("registry_year");     XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.КоличествоДверей));                                                      XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                              XML.ЗаписатьКонецЭлемента();
 		
		Попытка
			ЦенаМинимальная =  СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,""))-Число(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));         
		Исключение
			Попытка
				ЦенаМинимальная = СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));
			Исключение
				ЦенаМинимальная = "";
			КонецПопытки; 		

		КонецПопытки; 
		
		XML.ЗаписатьНачалоЭлемента("Price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(ЦенаМинимальная,Символы.НПП,"")));                                XML.ЗаписатьКонецЭлемента(); 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаПриПокупкеВКредит) Тогда
 			XML.ЗаписатьНачалоЭлемента("CreditDiscount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));                   XML.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаПриСтраховании) Тогда
			XML.ЗаписатьНачалоЭлемента("InsuranceDiscount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));                      XML.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидаПриПокупкеВТрейдИн) Тогда
			XML.ЗаписатьНачалоЭлемента("TradeinDiscount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));                   XML.ЗаписатьКонецЭлемента();  
		КонецЕсли; 
		
		Если НЕ обЗначениеНезаполнено(Стр1.СкидкаМаксимальная) Тогда
			XML.ЗаписатьНачалоЭлемента("MaxDiscount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));                        XML.ЗаписатьКонецЭлемента(); 
		КонецЕсли; 
		
		XML.ЗаписатьНачалоЭлемента("Make");                    XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвито.Наименование);                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Model");                   XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвито.Наименование);                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Year");                    XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                      XML.ЗаписатьКонецЭлемента();
		
		//XML.ЗаписатьНачалоЭлемента("Kilometrage");           XML.ЗаписатьТекст(СокрЛП(Стр1.Пробег));                                                               XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("Accident");              XML.ЗаписатьТекст("Не битый");                                                                        XML.ЗаписатьКонецЭлемента();
		
 		XML.ЗаписатьНачалоЭлемента("VIN");                     XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                               XML.ЗаписатьКонецЭлемента();
 		XML.ЗаписатьНачалоЭлемента("BodyType");                XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу));             XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("Doors");                   XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.КоличествоДверей));                      XML.ЗаписатьКонецЭлемента();
		
		XML.ЗаписатьНачалоЭлемента("ModificationId");          XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвито.Артикул);                      XML.ЗаписатьКонецЭлемента();
  		XML.ЗаписатьНачалоЭлемента("GenerationId");            XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.ГенерацияАвито.Артикул);                                     XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("ComplectationId");         XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвито.Артикул);                     XML.ЗаписатьКонецЭлемента();	
		XML.ЗаписатьНачалоЭлемента("Color");                   XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                           XML.ЗаписатьКонецЭлемента();
		
		ТипТоплива = Стр1.Автомобиль.ВариантКомплектации.ТипДвигателя.ТипТоплива;
		Если ТипТоплива = Перечисления.ТипыТоплива.LiquefiedGas ИЛИ ТипТоплива = Перечисления.ТипыТоплива.PressureGas Тогда
			XML.ЗаписатьНачалоЭлемента("FuelType");            XML.ЗаписатьТекст("Газ");                                                                             XML.ЗаписатьКонецЭлемента();
 		Иначе
 			XML.ЗаписатьНачалоЭлемента("FuelType");            XML.ЗаписатьТекст(СокрЛП(ТипТоплива));                                                                     XML.ЗаписатьКонецЭлемента();	
		КонецЕсли; 
		
		EngineSize_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.ОбъемДвигателя*1000),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(EngineSize_str) Тогда
			XML.ЗаписатьНачалоЭлемента("EngineSize");          XML.ЗаписатьТекст(EngineSize_str);                                                                    XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Power_str =  СтрЗаменить(СокрЛП(Стр1.Автомобиль.МощностьДвигателя),Символы.НПП,"");
		Если НЕ обЗначениеНеЗаполнено(Power_str) Тогда
			XML.ЗаписатьНачалоЭлемента("Power");               XML.ЗаписатьТекст(Power_str);                                                                         XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		Transmission_str = СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКПП.Наименование); 
		Если НЕ обЗначениеНеЗаполнено(Transmission_str) Тогда
			XML.ЗаписатьНачалоЭлемента("Transmission");        XML.ЗаписатьТекст(Transmission_str);                                                                  XML.ЗаписатьКонецЭлемента();
		КонецЕсли;

		DriveType_ = Стр1.Автомобиль.Привод;
		Если DriveType_= Перечисления.Привод.Передний Или DriveType_= Перечисления.Привод.Задний ИЛИ DriveType_= Перечисления.Привод.Полный Тогда
			DriveType_str = СокрЛП(DriveType_);    
		Иначе 
			DriveType_str =  "Полный";
		КонецЕсли;	
		Если НЕ обЗначениеНеЗаполнено(DriveType_str) Тогда
			XML.ЗаписатьНачалоЭлемента("DriveType");            XML.ЗаписатьТекст(DriveType_str);                                                                    XML.ЗаписатьКонецЭлемента();
		КонецЕсли;
  		
		WheelType_str = СокрЛП(Стр1.Автомобиль.Руль);
		WheelType_str = Врег(Сред(WheelType_str,1,1))+Сред(WheelType_str,2);
 		Если НЕ обЗначениеНеЗаполнено(WheelType_str) Тогда
			XML.ЗаписатьНачалоЭлемента("WheelType");            XML.ЗаписатьТекст(WheelType_str);                                                                    XML.ЗаписатьКонецЭлемента();
 		КонецЕсли;
  		
		//Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
	  		XML.ЗаписатьНачалоЭлемента("Images");
			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
				Если ИмяБазы = "alfaauto" Тогда                                                                              
					//Бондаренко++ 20220303
					//СсылкаНаФото = СокрЛП("https://it.sokolmotors.ru/alfaauto/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
					СсылкаНаФото = СокрЛП("https://it.sokolmotors.ru/alfaauto/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.GUID+".jpg");
					//Бондаренко-- 20220303
				Иначе                      
					//Бондаренко++ 20220303
					//СсылкаНаФото = СокрЛП("https://sm-1cdev01/"+ИмяБазы+"/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки);
					СсылкаНаФото = СокрЛП("https://sm-1cdev01/"+ИмяБазы+"/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.GUID+".jpg");
					//Бондаренко-- 20220303
				КонецЕсли; 
				XML.ЗаписатьНачалоЭлемента("Image");
  				XML.ЗаписатьАтрибут("url",СсылкаНаФото);
				XML.ЗаписатьКонецЭлемента();
 			КонецЦикла; 
 			XML.ЗаписатьКонецЭлемента(); //Images	
		//КонецЕсли; 
		
		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929
		
		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
 			XML.ЗаписатьНачалоЭлемента("VideoURL");     XML.ЗаписатьТекст(ВидеоДляСайта);                	                                                         XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
  		
		XML.ЗаписатьКонецЭлемента(); //Ad

 	КонецЦикла; 
	
  	XML.ЗаписатьКонецЭлемента();     //Ads
	
	XMLТекст = XML.Закрыть();
	
 	Возврат XMLТекст;

КонецФункции // ВернутьXMLкакСтроку4() avito

//Для auto.ru
Функция ВернутьXMLкакСтроку3(СЗ_КодовПодразделений) Экспорт
	
	СЗ_КодовРодителей = Новый СписокЗначений;
	
	МассивКодовРодителейПодразделений = обМояРазложитьСтрокуВМассивПодстрок(СЗ_КодовПодразделений, ";");
	СЗ_КодовРодителей.ЗагрузитьЗначения(МассивКодовРодителейПодразделений);
 	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка,
		|	ПодразделенияКомпании.Родитель.Код
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.Родитель.Код В (&СЗ_КодовРодителей)";
	
	Запрос.УстановитьПараметр("СЗ_КодовРодителей", СЗ_КодовРодителей);
	
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
   	ТЗ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
		
 	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN КАК VIN,
		|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Остаток,
		|	ЦенаАвто.Цена КАК Цена,
		|	ХарАвто.Значение КАК ВидАвто,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение КАК Подразделение,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу КАК МаркаАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу КАК МодельАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу КАК МодификацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу КАК КомплектацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена КАК СпециальнаяЦена,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит КАК СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании КАК СкидкаПриСтраховании,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн КАК СкидаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная КАК СкидкаМаксимальная,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу КАК ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик КАК ОкраскаМеталлик,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль КАК Руль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей КАК КоличествоДверей,
		|	ПробегиАвто.Значение КАК Пробег,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние КАК Состояние,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС КАК КоличествоВладельцев,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваВариантаКомплектации,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу КАК ТипКузоваМодели
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦеныАвтомобилейСрезПоследних.Цена КАК Цена,
		|			ЦеныАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
		|			ЦеныАвтомобилейСрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен КАК ТипЦен
		|		ИЗ
		|			РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
		|		ГДЕ
		|			ЦеныАвтомобилейСрезПоследних.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи)) КАК ЦенаАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЦенаАвто.Автомобиль
		|			И ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации = ЦенаАвто.Автомобиль.ВариантКомплектации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля)) КАК ХарАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ХарАвто.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			АвтомобилиСрезПоследних.Автомобиль КАК Автомобиль,
		|			АвтомобилиСрезПоследних.ВидЗначения КАК ВидЗначения,
		|			АвтомобилиСрезПоследних.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|		ГДЕ
		|			АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК ПробегиАвто
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ПробегиАвто.Автомобиль
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
		|	И ХарАвто.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
		|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение В(&СписокПодразделений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.VIN,
		|	ЦенаАвто.Цена,
		|	ХарАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение.ДилерскийЦентр,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу.МаркаАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.МодельАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.МодификацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СпециальнаяЦена,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриПокупкеВКредит,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаПриСтраховании,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидаПриПокупкеВТрейдИн,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.СкидкаМаксимальная,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ЦветАвтоРу,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Цвет.ОкраскаМеталлик,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.Руль,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.КоличествоДверей,
		|	ПробегиАвто.Значение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Состояние,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.КоличествоВладельцевПоПТС,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу,
		|	ОстаткиАвтомобилейОстатки.СкладКомпании.Подразделение,
		|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу
		|
		|УПОРЯДОЧИТЬ ПО
		|	VIN";
	
	Запрос.УстановитьПараметр("СписокПодразделений",СписокПодразделений);
     	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ИмяБазы = "alfaauto";
	Попытка
		Результат = Renault_внОбщийМодуль.ПараметрУникальностиИБ();
 		ИмяБазы = СокрЛП(Результат.ИмяБазы);
	Исключение
		//	
	КонецПопытки; 
	
 	СписокМарок = Новый СписокЗначений;
  	
  	XML=Новый ЗаписьXML();
 	
	XML.УстановитьСтроку(Новый ПараметрыЗаписиXML("UTF-8","1.0",false));
	XML.ЗаписатьОбъявлениеXML();
	
  	XML.ЗаписатьНачалоЭлемента("Data");
	
	XML.ЗаписатьНачалоЭлемента("Cars");
	
	Для каждого Стр1 Из ТЗ Цикл
		
		//Бондаренко++ 20200615
		//Если обЗначениеНеЗаполнено(Стр1.Цена) Тогда	Продолжить;	КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу) Тогда Продолжить; КонецЕсли; 
		//Если обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.МодельАвтоРу) Тогда Продолжить; КонецЕсли; 
		//Бондаренко-- 20200615
		
		 Если НЕ обЗначениеНеЗаполнено(Стр1.Подразделение) Тогда
		  	СписокМарок = ПолучитьСписокМарокАвто(Стр1.Подразделение);
			Если СписокМарок.НайтиПоЗначению(Стр1.Автомобиль.Модель.Марка) = Неопределено Тогда
		 		Продолжить;	
			КонецЕсли; 
		КонецЕсли; 
 		
 		XML.ЗаписатьНачалоЭлемента("car");
		XML.ЗаписатьНачалоЭлемента("mark_id");             XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.Марка.МаркаАвтоРу.Наименование);                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("folder_id");           XML.ЗаписатьТекст(Стр1.Автомобиль.Модель.МодельАвтоРу.Наименование);                                   XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("modification_id");     XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.МодификацияАвтоРу.Наименование);                 XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("complectation_name");  XML.ЗаписатьТекст(Стр1.Автомобиль.ВариантКомплектации.КомплектацияАвтоРу.Наименование);                XML.ЗаписатьКонецЭлемента();
		
		Если НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу) Тогда
 		 	XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.ВариантКомплектации.ТипКузова.ТипКузоваАвтоРу)); XML.ЗаписатьКонецЭлемента();
		ИначеЕсли НЕ обЗначениеНеЗаполнено(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу) Тогда
 		    XML.ЗаписатьНачалоЭлемента("body_type");       XML.ЗаписатьТекст(СокрЛП(Стр1.Автомобиль.Модель.ТипКузова.ТипКузоваАвтоРу));              XML.ЗаписатьКонецЭлемента();
		КонецЕсли; 
 		
		XML.ЗаписатьНачалоЭлемента("wheel");               XML.ЗаписатьТекст(СокрЛП(Стр1.Руль));                                                                  XML.ЗаписатьКонецЭлемента();
  		XML.ЗаписатьНачалоЭлемента("color");               XML.ЗаписатьТекст(СокрЛП(Стр1.ЦветАвтоРу));                                                            XML.ЗаписатьКонецЭлемента();
  		XML.ЗаписатьНачалоЭлемента("metallic");            XML.ЗаписатьТекст(СокрЛП(Нрег(Стр1.Автомобиль.Цвет.ОкраскаМеталлик)));                                 XML.ЗаписатьКонецЭлемента();
        XML.ЗаписатьНачалоЭлемента("availability");        XML.ЗаписатьТекст("В наличии");                                                                        XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("custom");              XML.ЗаписатьТекст("Растаможен");                                                                       XML.ЗаписатьКонецЭлемента();
 		XML.ЗаписатьНачалоЭлемента("state");               XML.ЗаписатьТекст(СокрЛП(Стр1.Состояние));                                                             XML.ЗаписатьКонецЭлемента();
 		XML.ЗаписатьНачалоЭлемента("owners_number");       XML.ЗаписатьТекст("Не было владельцев");                                                               XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("run");               XML.ЗаписатьТекст(СокрЛП(Стр1.Пробег));                                                                XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("run");                 XML.ЗаписатьТекст("0");                                                                                XML.ЗаписатьКонецЭлемента();
 		XML.ЗаписатьНачалоЭлемента("year");                XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
		//XML.ЗаписатьНачалоЭлемента("registry_year");     XML.ЗаписатьТекст(Формат(Стр1.Автомобиль.ГодВыпуска,"ДФ=yyyy"));                                       XML.ЗаписатьКонецЭлемента();
 		XML.ЗаписатьНачалоЭлемента("doors_count");         XML.ЗаписатьТекст(СокрЛП(Стр1.КоличествоДверей));                                                      XML.ЗаписатьКонецЭлемента();
 		XML.ЗаписатьНачалоЭлемента("currency");            XML.ЗаписатьТекст("RUR");                                                                              XML.ЗаписатьКонецЭлемента();
		XML.ЗаписатьНачалоЭлемента("vin");                 XML.ЗаписатьТекст(Стр1.Автомобиль.VIN);                                                                XML.ЗаписатьКонецЭлемента();
		
		Попытка
			ЦенаМинимальная =  СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,""))-Число(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));         
		Исключение
			Попытка
				ЦенаМинимальная = СокрЛП(Число(СтрЗаменить(Стр1.Цена,Символы.НПП,"")));
			Исключение
				ЦенаМинимальная = "";
			КонецПопытки; 		
		КонецПопытки; 
		 
		XML.ЗаписатьНачалоЭлемента("price");               XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(ЦенаМинимальная,Символы.НПП,"")));                                XML.ЗаписатьКонецЭлемента(); 
		//XML.ЗаписатьНачалоЭлемента("special_price");       XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СпециальнаяЦена,Символы.НПП,"")));                         XML.ЗаписатьКонецЭлемента(); 
		//XML.ЗаписатьНачалоЭлемента("credit_discount");     XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриПокупкеВКредит,Символы.НПП,"")));                 XML.ЗаписатьКонецЭлемента(); 
		//XML.ЗаписатьНачалоЭлемента("insurance_discount");  XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаПриСтраховании,Символы.НПП,"")));                    XML.ЗаписатьКонецЭлемента();  
		//XML.ЗаписатьНачалоЭлемента("tradein_discount");    XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидаПриПокупкеВТрейдИн,Символы.НПП,"")));                 XML.ЗаписатьКонецЭлемента();  
		//XML.ЗаписатьНачалоЭлемента("max_discount");        XML.ЗаписатьТекст(СокрЛП(СтрЗаменить(Стр1.СкидкаМаксимальная,Символы.НПП,"")));                      XML.ЗаписатьКонецЭлемента(); 

		Если Стр1.Автомобиль.ПутьКФото.Количество() > 0 Тогда
	  		XML.ЗаписатьНачалоЭлемента("images");
 			Для каждого СтрТЧ Из Стр1.Автомобиль.ПутьКФото Цикл
 				XML.ЗаписатьНачалоЭлемента("image");
				Если ИмяБазы = "alfaauto" Тогда                                                                          
					//Бондаренко++ 20220303
					//XML.ЗаписатьТекст("https://it.sokolmotors.ru/alfaauto/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки+".jpg");
					XML.ЗаписатьТекст("https://it.sokolmotors.ru/alfaauto/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.GUID+".jpg");					
					//Бондаренко-- 20220303
				Иначе             
					//Бондаренко++ 20220303
					//XML.ЗаписатьТекст("https://sm-1cdev01/"+ИмяБазы+"/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.НомерСтроки);
					XML.ЗаписатьТекст("https://sm-1cdev01/"+ИмяБазы+"/hs/autoru3/img/"+Стр1.Автомобиль.VIN+"/"+СтрТЧ.GUID);
					//Бондаренко-- 20220303
 				КонецЕсли; 
  				XML.ЗаписатьКонецЭлемента(); //url	
 			КонецЦикла; 
 			XML.ЗаписатьКонецЭлемента(); //images	
		КонецЕсли; 
		
		//Бондаренко++ 20220929                    
		ВидеоДляСайта = "";
		ВидеоДляСайта = СМ_ВыгрузкаОбъявленийОПродажеАвто.СМГ_СправочникВернутьЗначениеРеквизита("СсылкаНаВидео",Стр1.Автомобиль.ПолучитьОбъект());
		ВидеоДляСайта = СтрЗаменить(ВидеоДляСайта,"https://youtu.be/","https://www.youtube.com/watch?v=");		
		//Бондаренко-- 20220929
		
		Если НЕ обЗначениеНеЗаполнено(ВидеоДляСайта) Тогда
			XML.ЗаписатьНачалоЭлемента("video");     XML.ЗаписатьТекст(ВидеоДляСайта); 	                                                          XML.ЗаписатьКонецЭлемента(); 		
		КонецЕсли; 
		
		ТекстКлассифайда = СокрЛП(Стр1.Автомобиль.Модель.ТекстКлассифайда);
	    Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	    	ТекстКлассифайда = СокрЛП(Стр1.Подразделение.ТекстКлассифайда);
	    	Если обЗначениеНеЗаполнено(ТекстКлассифайда) Тогда
	    		ТекстКлассифайда = СокрЛП(Стр1.Подразделение.Родитель.ТекстКлассифайда);
	  	    КонецЕсли; 
	    КонецЕсли; 
		
 		XML.ЗаписатьНачалоЭлемента("description");   XML.ЗаписатьТекст(ТекстКлассифайда);                                                                         XML.ЗаписатьКонецЭлемента();	 //comment
		
		XML.ЗаписатьКонецЭлемента(); //Car

 	КонецЦикла; 
	
	XML.ЗаписатьКонецЭлемента();	 //Cars
	
	XML.ЗаписатьКонецЭлемента();         //Data
	
	XMLТекст = XML.Закрыть();
	
 	Возврат XMLТекст;

КонецФункции // ВернутьXMLкакСтроку3()

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция обМояРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // обМояРазложитьСтрокуВМассивПодстрок

Функция ПолучитьФотоАвтомобиля(VIN,НомерКартинки) Экспорт
	
	ПолныйПутьКХранилищу = ""; 
	
 	ПолныйПутьКХранилищу = СокрЛП(Константы.ПустьКХранилищюСканов.Получить())+"\"+СокрЛП(ОбщиеСервер.ПолучитьИмяИБ())+"\carphoto\"+VIN+"\"+НомерКартинки+".jpg";
	
	Если НЕ обЗначениеНеЗаполнено(ПолныйПутьКХранилищу) Тогда
		ДвоичныеДанныеКартинки = Новый ДвоичныеДанные(ПолныйПутьКХранилищу);
		Возврат ДвоичныеДанныеКартинки;
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции

Функция ПолучитьСписокМарокАвто(Подр) Экспорт
	
	СЗ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка,
		|	ПодразделенияКомпанииМаркиАвтомобилей.Марка
		|ИЗ
		|	Справочник.ПодразделенияКомпании.МаркиАвтомобилей КАК ПодразделенияКомпанииМаркиАвтомобилей
		|ГДЕ
		|	ПодразделенияКомпанииМаркиАвтомобилей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Подр);
	
	СЗ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Марка"));
	
	Если СЗ.Количество() = 0 Тогда
		Если НЕ обЗначениеНеЗаполнено(Подр.Родитель) Тогда
			СЗ = ПолучитьСписокМарокАвто(Подр.Родитель);
			Если СЗ.Количество() > 0 Тогда
				Возврат СЗ;	 	
 			КонецЕсли;
		Иначе
			Возврат СЗ;	 	
		КонецЕсли; 
	Иначе	
		Возврат СЗ;	 
 	КонецЕсли; 
  
КонецФункции // ПолучитьСписокМарок()

//Бондаренко++ 20220622
Функция СМГ_СправочникВернутьЗначениеРеквизита(ИмяРеквизита,ЭтотОбъект) Экспорт
  
   Попытка
    ЗначениеРеквизита = ЭтотОбъект[ИмяРеквизита];
  Исключение                                                       
  КонецПопытки;
  
  Если обЗначениеНеЗаполнено(ЗначениеРеквизита) Тогда
    Попытка  
      ВарКомпл = ЭтотОбъект.ВариантКомплектации.ПолучитьОбъект();
      ЗначениеРеквизита = ВарКомпл[ИмяРеквизита];
    Исключение              
    КонецПопытки;
  КонецЕсли;
  
  Если обЗначениеНеЗаполнено(ЗначениеРеквизита) Тогда
    Попытка
      Модель = ЭтотОбъект.Модель.ПолучитьОбъект();
      ЗначениеРеквизита = Модель[ИмяРеквизита];
    Исключение
    КонецПопытки;
  КонецЕсли;
   
  Возврат ЗначениеРеквизита;       
 
КонецФункции // СМГ_СправочникВернутьЗначениеРеквизита(ИмяРеквизита,ЭтотОбъект)
//Бондаренко++ 20220622
